fonecmid-diplom/src/Documents/BKM_ГрафикОтпусков/BKM_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BKM_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.BKM_СведенияОбОтпусках</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.BKM_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщаяПродолжительностьОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/BKM_ГрафикОтпусков/Forms/ФормаАнализГрафика/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	Диаграмма.Очистить();
	
	// Меняем заголовок колонки
	Элементы.ДиаграммаТаблицаТочка.Заголовок = "Сотрудник";
	
	Если Не ЭтоАдресВременногоХранилища(Параметры.Адрес) Тогда
		ТекстСообщения = "Построение диаграммы не возможно. Ошибка получения данных для построения графика.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
		Возврат;
	КонецЕсли;
	
	ГрафикОтпусков = ПолучитьИзВременногоХранилища(Параметры.Адрес);  		
	
	//Создаем строго ОДНУ серию. 
	//платформу выводить каждого сотрудника ровно в одну строку.
	СерияОтпусков = Диаграмма.Серии.Добавить();
	СерияОтпусков.Текст = "Отпуска сотрудников";
	
	Для Каждого Строка Из ГрафикОтпусков Цикл  
		
		Точка = Диаграмма.УстановитьТочку(Строка.Сотрудник);
		Точка.Текст = Строка(Строка.Сотрудник);
		
		Значение = Диаграмма.ПолучитьЗначение(Точка, СерияОтпусков);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = НачалоДня(Строка.ДатаНачала);
		Интервал.Конец = КонецДня(Строка.ДатаОкончания);  
		
		//Раскрашиваем интервалы индивидуально, а не серии целиком
		Если Строка.ОбщаяПродолжительностьОтпуска > 28 Тогда 
			Интервал.Цвет = WebЦвета.Томатный;
			Интервал.Текст = "Отпуск более 28 дней (" + Строка.ОбщаяПродолжительностьОтпуска + " дн.)";
		Иначе     
			Интервал.Цвет = WebЦвета.СинеФиолетовый;
			Интервал.Текст = "Основной отпуск (" + Строка.ОбщаяПродолжительностьОтпуска + " дн.)";
		КонецЕсли;  
		
	КонецЦикла;	
	
КонецПроцедуры
